Tekla Open API Reference for Tekla Structures 2025
CannotGetAttributeForPluginException Class
 The CannotGetAttributeForPluginException class defines the exception that is thrown when Plugin.GetAttribute is called but the attribute cannot be fetched.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotGetAttributeForPluginException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotGetAttributeForPluginException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotGetAttributeForPluginException
	Inherits TeklaStructuresDrawingsApplicationException
Constructors
Name | Description
CannotGetAttributeForPluginException()
 Creates a new CannotGetAttributeForPluginException instance.
CannotGetAttributeForPluginException(String)
 Creates a new CannotGetAttributeForPluginException instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace